[
  {
    "id": 1,
    "startDate": "2023/10/01",
    "endDate": "2024/03/05",
    "description": "  <h1>E Network</h1>\n    <h2>Company Overview</h2>\n    <p>A company focused on web development and application performance optimization.</p>\n\n    <h2>Key Contributions</h2>\n    <ul>\n        <li>\n            <strong>Implemented Lazy Loading:</strong> Used the <code>react-lazy</code> library to dynamically load components, \n            reducing initial page load times by <strong>40%</strong> and improving overall application performance.\n        </li>\n        <li>\n            <strong>Optimized Performance with Next.js:</strong> Utilized Next.js for \n            <abbr title=\"Server-Side Rendering\">SSR</abbr> and \n            <abbr title=\"Static Site Generation\">SSG</abbr>, improving React application \n            performance and <abbr title=\"Search Engine Optimization\">SEO</abbr> through \n            pre-rendering and efficient data fetching, increasing website loading speed by <strong>25%</strong>.\n        </li>\n        <li>\n            <strong>Enhanced Security:</strong> Developed robust authentication mechanisms using \n            <abbr title=\"JSON Web Tokens\">JWT</abbr> and cookies, enhancing security and user \n            session management, reducing unauthorized access incidents by <strong>35%</strong>.\n        </li>\n        <li>\n            <strong>Streamlined Routing:</strong> Created custom routers and controllers, leading \n            to a more organized codebase and a <strong>20%</strong> increase in application responsiveness.\n        </li>\n        <li>\n            <strong>Optimized File Uploads:</strong> Managed file uploads efficiently using \n            <code>Multer</code>, improving user experience and reducing file upload errors by <strong>30%</strong>.\n        </li>\n    </ul>"
  },
  {
    "id": 2,
    "startDate": "2022-03-11",
    "endDate": "2025-03-05",
    "description": "<p><strong>Implemented Lazy Loading:</strong> Used the <code>react-lazy</code> library to dynamically load components, reducing initial page load times by <strong>40%</strong> and improving overall application performance.</p><p><strong>Optimized Performance with Next.js:</strong> Leveraged <strong>Server-Side Rendering (SSR)</strong> and <strong>Static Site Generation (SSG)</strong> to enhance performance and SEO, leading to a <strong>25%</strong> increase in website loading speed.</p><p><strong>Developed Secure Authentication:</strong> Implemented <strong>JSON Web Tokens (JWT)</strong> and <strong>cookies</strong> to enhance security and user session management, reducing unauthorized access incidents by <strong>35%</strong>.</p><p><strong>Designed Custom Routers &amp; Controllers:</strong> Created efficient routing and data-handling mechanisms, resulting in a more organized codebase and a <strong>20%</strong> boost in application responsiveness.</p><p><strong>Managed File Uploads Efficiently:</strong> Utilized <strong>Multer</strong> for file handling, improving the user experience and reducing file upload errors by <strong>30%</strong>.</p>"
  },
  {
    "id": 3,
    "startDate": "2024-03-18",
    "endDate": "2025-03-11",
    "description": "<h3>Optimization</h3><ul><li><p><strong>Implemented Lazy Loading</strong>: Used the <code>react-lazy</code> library to dynamically load components, reducing initial page load times by 40% and enhancing overall application performance.</p></li><li><p><strong>Optimized Performance with Next.js</strong>: Leveraged Server-Side Rendering (SSR) and Static Site Generation (SSG) to improve React application performance and SEO, increasing website loading speed by 25%.</p></li><li><p><strong>Enhanced Security with JWT &amp; Cookies</strong>: Developed robust authentication mechanisms using JSON Web Tokens (JWT) and cookies, improving security and session management, reducing unauthorized access incidents by 35%.</p></li><li><p><strong>Streamlined Routing &amp; Data Handling</strong>: Created custom routers and controllers, improving code organization and increasing application responsiveness by 20%.</p></li><li><p><strong>Efficient File Uploads with Multer</strong>: Managed file uploads using Multer, ensuring efficient processing and reducing file upload errors by 30%, enhancing user experience.</p></li></ul>"
  }
]